results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg1024-tps1000-batch16384-acks1-prod6-complz4-trial2/producer-perf-2.log
producer_index=2
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.00 MB/sec), 7359.0 ms avg latency, 7359.0 ms max latency.
2069 records sent, 413.4 records/sec (0.40 MB/sec), 937.6 ms avg latency, 1815.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 7.8 ms avg latency, 36.0 ms max latency.
837 records sent, 167.1 records/sec (0.16 MB/sec), 8.0 ms avg latency, 26.0 ms max latency.
835 records sent, 166.9 records/sec (0.16 MB/sec), 7.9 ms avg latency, 25.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 7.3 ms avg latency, 22.0 ms max latency.
837 records sent, 167.2 records/sec (0.16 MB/sec), 7.4 ms avg latency, 21.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 7.3 ms avg latency, 23.0 ms max latency.
837 records sent, 167.2 records/sec (0.16 MB/sec), 7.2 ms avg latency, 35.0 ms max latency.
835 records sent, 166.9 records/sec (0.16 MB/sec), 6.8 ms avg latency, 18.0 ms max latency.
837 records sent, 167.3 records/sec (0.16 MB/sec), 6.7 ms avg latency, 14.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 6.2 ms avg latency, 13.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 6.5 ms avg latency, 30.0 ms max latency.
836 records sent, 167.1 records/sec (0.16 MB/sec), 6.3 ms avg latency, 20.0 ms max latency.
836 records sent, 167.2 records/sec (0.16 MB/sec), 6.2 ms avg latency, 23.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 6.1 ms avg latency, 22.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 6.0 ms avg latency, 20.0 ms max latency.
836 records sent, 167.0 records/sec (0.16 MB/sec), 6.0 ms avg latency, 20.0 ms max latency.
835 records sent, 167.0 records/sec (0.16 MB/sec), 6.0 ms avg latency, 8.0 ms max latency.
16667 records sent, 166.953821 records/sec (0.16 MB/sec), 122.77 ms avg latency, 7359.00 ms max latency, 7 ms 50th, 1383 ms 95th, 1667 ms 99th, 1811 ms 99.9th.